gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
/*************************************************
版  权:正泰仪表智能终端部
文  件:QCSG_Ctrl.c
作  者:mxn
版  本:1.00
日  期:20170601
描  述:负控控制文件
*************************************************/
/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "../MS/MS.h"
#include "../Hcsg/ProjectCSG.h"
#include "../Hcsg/Pin_ProjectCSG_3xx.h"
#include "../STM32F4xx/STM32F4xx_IO.h"
#include "../QCSG_Head/QCSG_UpLinkProtocol.h"
#include "../QCSG_Head/QCSG_DLT645_Protocol.h"

#include "../QCSG_Head/ReadMeter_Task.h"
#include "../QCSG_Head/Chint_Type.h"
#include "../QCSG_Head/QCSG_PublicDefine.h"
#include "../QCSG_Head/QCSG_Publicfunc.h"
#include "../QCSG_Head/QCSG_Hal.h"
#include "../QCSG_Data/QCSG_NandDataInterface.h"
#include "Terminal_Task.h"

#if ((Project/100)==3)	//负控终端
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define LED_SWITCH1				0x01
#define LED_SWITCH2				0x02
#define LED_SWITCH3				0x04
#define LED_SWITCH4				0x08
#define LED_ALARM				0x10
#define LED_HOLDPOWER			0x20
#define LED_POWERCTRL			0x40
#define LED_ENERGYCTRL			0x80
#define POWER_IDLE_STEP			0x00
#define POWER_OCCUR_STEP		0x01
#define POWER_RESTORE_STEP		0x02
/* Private constants ---------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Public variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Public functions ----------------------------------------------------------*/
/**--------------------------------------------------------------------
*功    能:获取终端保电状态，两种特殊情况下的保电，非协议设置的保电状态
*输入参数:pstCtrl_Param_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
u8 GetPowerHoldState(QCSG_CTRL_INFO_S* pstCtrl_Info,LoadManagementParaStruct* pstCtrl_Param_Info)
{	
	u8 u8Timeout = 15;
	
#if defined(FKGA43_CL3200_TEST)
	u8Timeout = 2;
#endif
	//终端上电15min内，为保电状态
	if(pstCtrl_Info->u8PowerUpFlag == 0)
	{
		if(pstCtrl_Info->u32ReadCtrlParamTick < 6000 * u8Timeout)
		{
			pstCtrl_Info->u8PowerHoldState = 1;
		}
		else
		{
			pstCtrl_Info->u8PowerUpFlag = 0x01;
		}
	}
	//与主站持续断线，保电状态为1，此部分待补充
	if(pstCtrl_Info->u8PowerHoldState == 0x01)
	{
		//保电状态，清除所有终端控制状态
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;
		pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;	
		pstCtrl_Info->u8SlipTimeoutFlag = 0;		
		pstCtrl_Info->u32EnergyAlarmTimeoutTick = 0;
		pstCtrl_Info->u8EnergyAlarmFlag = 0;
		pstCtrl_Info->u8EnergyCtrlSwitchState = 0;
		pstCtrl_Info->u8YKCtrlSwitchState = 0;
		pstCtrl_Info->u8YKAlarmFlag = 0;
		pstCtrl_Info->u32YKAlarmTimeoutTick = 0;		
		pstCtrl_Info->u8YKState = 0;
		QCSG_WriteTerminal_State(pstCtrl_Info->u8YXState,pstCtrl_Info->u8YKState);
		Pin_OutH(PIN_SWITCH_OUT1);
		Pin_OutH(PIN_SWITCH_OUT2);
		Pin_OutH(PIN_SWITCH_OUT3);
		Pin_OutH(PIN_SWITCH_OUT4);
		Pin_OutH(PIN_ALARM_OUT);
		//点亮保电灯
		pstCtrl_Info->u8LedState |= LED_HOLDPOWER;
		//关闭告警灯
		pstCtrl_Info->u8LedState &= (~LED_ALARM);
		//关闭轮次灯
		pstCtrl_Info->u8LedState &= (~LED_SWITCH1);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH2);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH3);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH4);		
		return TRUE;
	}
	//关闭保电灯
	pstCtrl_Info->u8LedState &= (~LED_HOLDPOWER);
	return FALSE;
}
/**--------------------------------------------------------------------
*功    能:更新控制结构体信息
*输入参数:pstCtrl_Param_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Update_Ctrl_Info(LoadManagementParaStruct* pstCtrl_Param_Info,QCSG_CTRL_INFO_S* pstCtrl_Info,QCSG_CTRL_POWERDOWN_SAVE_INFO_S* pstCtrl_PowerDown_Save_Info)
{
	TIME_PARAM_S stSysCurrTime;
	u8 u8Time_Hour = 0,u8Time_Min = 0,u8FloatCoeff = 0,u8TempCtrlChange = 0,u8TimeCtrlChange = 0,u8EnergyChange = 0;
	u32 u32ReadLen = 0,u32LimitPower = 0,u32MaxEnergy_Month = 0,u32RoundEnergy_Month = 0;
	
	HAL_GetSystemTime(&stSysCurrTime);
	if(NAND_ReadPara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen) != NO_ERROR)
	{
		return;
	}	
	//更新遥信开关属性
	if((pstCtrl_Param_Info->SwitchNodeType[1] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[1] != 0x01))
	{
		pstCtrl_Info->u8Switch1Attr = 0x00;
	}
	else
	{
		pstCtrl_Info->u8Switch1Attr = pstCtrl_Param_Info->SwitchNodeType[1];
	}
	if((pstCtrl_Param_Info->SwitchNodeType[2] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[2] != 0x01))
	{
		pstCtrl_Info->u8Switch2Attr = 0x00;
	}
	else
	{
		pstCtrl_Info->u8Switch2Attr = pstCtrl_Param_Info->SwitchNodeType[2];
	}
	if((pstCtrl_Param_Info->SwitchNodeType[3] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[3] != 0x01))
	{
		pstCtrl_Info->u8Switch3Attr = 0x00;
	}
	else
	{
		pstCtrl_Info->u8Switch3Attr = pstCtrl_Param_Info->SwitchNodeType[3];
	}
	if((pstCtrl_Param_Info->SwitchNodeType[4] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[4] != 0x01))
	{
		pstCtrl_Info->u8Switch4Attr = 0x00;
	}
	else
	{
		pstCtrl_Info->u8Switch4Attr = pstCtrl_Param_Info->SwitchNodeType[4];
	}
	//更新保电状态
#if defined(FKGA43_CL3200_TEST)
	if((pstCtrl_Info->u8PowerHoldState == 1)&&(pstCtrl_Param_Info->PowerHoldState == 0))
	{
		//为过台体保电测试，此处增加如果解除保电，原遥控跳闸改为全合
		MemSet(pstCtrl_Param_Info->OutputSwitchState,0,sizeof(pstCtrl_Param_Info->OutputSwitchState));
		u32ReadLen = sizeof(LoadManagementParaStruct);
		NAND_WritePara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen);		
		pstCtrl_Info->u8YKCtrlSwitchState = 0;
		pstCtrl_Info->u8YKSwitchOutState = 0;
#if (TEST_ON == 1)//调试台体保电测试
		pstCtrl_Info->u8YKState = 0;
		QCSG_WriteTerminal_State(pstCtrl_Info->u8YXState,pstCtrl_Info->u8YKState);
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;
		pstCtrl_Info->u8EnergyCtrlSwitchState = 0;
		pstCtrl_Info->u8YKSwitchOutState = 0;
		//pstCtrl_Info->u8YKCtrlSwitchState = 0;
#endif
	}
#endif
	pstCtrl_Info->u8PowerHoldState = pstCtrl_Param_Info->PowerHoldState;
	//告警超时
	pstCtrl_Info->u32AlarmTimeout = QCSG_BCD2HEX(pstCtrl_Param_Info->AlarmDelayTime) * 60 * 100;	
	/**************************************月电控参数更新***************************************************/
	//更新电控有效标志
	if(pstCtrl_Info->u8EnergyCtrlFlag != pstCtrl_Param_Info->MonthKwhCtrlFlag)
	{
		u8EnergyChange = 1;		
	}
	pstCtrl_Info->u8EnergyCtrlFlag = pstCtrl_Param_Info->MonthKwhCtrlFlag;	
	//电量定值浮动系数
	u8FloatCoeff = pstCtrl_Param_Info->E0000C6C & 0x7F;
	if(QCSG_BCDCheck(&u8FloatCoeff,1) != TRUE)
	{
		pstCtrl_Info->u8EnergyFloatCoeff = 0;
	}
	else
	{
		if(pstCtrl_Info->u8EnergyFloatCoeff != pstCtrl_Param_Info->E0000C6C)
		{
			u8EnergyChange = 1;
		}
		pstCtrl_Info->u8EnergyFloatCoeff = pstCtrl_Param_Info->E0000C6C;
	}
	//电控累加标志
	if(pstCtrl_Info->u8EnergySumFlag != pstCtrl_Param_Info->KwhCtrlIncFlag)
	{
		u8EnergyChange = 1;
	}
	pstCtrl_Info->u8EnergySumFlag = pstCtrl_Param_Info->KwhCtrlIncFlag;
	//电控总加组
	if(memcmp(pstCtrl_Info->u16EnergySumPnList, pstCtrl_Param_Info->KwhCtrlPoint, sizeof(pstCtrl_Info->u16EnergySumPnList)) != 0)
	{
		u8EnergyChange = 1;
	}
	MemCopy(pstCtrl_Info->u16EnergySumPnList, pstCtrl_Param_Info->KwhCtrlPoint, sizeof(pstCtrl_Info->u16EnergySumPnList));
	//电控轮次有效标志
	if(pstCtrl_Info->u8EnergyCtrl_RoundFlag != (pstCtrl_Param_Info->MonthKwhCtrlRoundFlag & 0x0F))
	{
		u8EnergyChange = 1;
	}
	pstCtrl_Info->u8EnergyCtrl_RoundFlag = (pstCtrl_Param_Info->MonthKwhCtrlRoundFlag & 0x0F);
	//月电量限额
	u32MaxEnergy_Month = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E00 >> 24)) * 1000000
									 + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E00 >> 16)) * 10000
									 + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E00 >> 8)) * 100
									 + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E00));
	if(pstCtrl_Info->u32MaxEnergy_Month != u32MaxEnergy_Month)
	{
		u8EnergyChange = 1;
	}
	pstCtrl_Info->u32MaxEnergy_Month = u32MaxEnergy_Month;
	//轮次电量
	u32RoundEnergy_Month = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E01 >> 24)) * 1000000
									   + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E01 >> 16)) * 10000
									   + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E01 >> 8)) * 100
									   + QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000E01));
	if(pstCtrl_Info->u32RoundEnergy_Month != u32RoundEnergy_Month)
	{
		u8EnergyChange = 1;
	}
	pstCtrl_Info->u32RoundEnergy_Month = u32RoundEnergy_Month;
	/**************************************月电控参数结束***************************************************/
	/**************************************临时控参数更新***************************************************/
	//更新临时控有效标志，及临时控有效时间等
	if((pstCtrl_Param_Info->E0000C70 & 0x0F000000) != 0x00)		//取有效标识
	{
		if(pstCtrl_Info->u8TempRationPowerUpFlag == 0)
		{
			//刚上电,从存储的时间中取得临时限电起始时间
			pstCtrl_Info->u8TempRationPowerUpFlag = 1;
			pstCtrl_Info->u8TempRationFlag = 1;
			//更新临时限电起始时间，从记录的时间中
			if(TimeValidCheck(&pstCtrl_PowerDown_Save_Info->stTempRationStartTime) != NO_ERROR)
			{
				MemCopy(&pstCtrl_Info->stTempRationStartTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
				MemCopy(&pstCtrl_PowerDown_Save_Info->stTempRationStartTime,&stSysCurrTime,sizeof(TIME_PARAM_S));	
			}
			else
			{
				MemCopy(&pstCtrl_Info->stTempRationStartTime,&pstCtrl_PowerDown_Save_Info->stTempRationStartTime,sizeof(TIME_PARAM_S));
			}
			pstCtrl_Info->u32SlipTick = 0;
			MemSet(pstCtrl_Info->s32MinutePowerList,0,sizeof(pstCtrl_Info->s32MinutePowerList));
			pstCtrl_Info->u32SlipCnt = 0;
			pstCtrl_Info->s32SlipPower = 0;
			pstCtrl_Info->u8SlipTimeoutFlag = 0;
		}
		if(pstCtrl_Info->u8TempRationFlag == 0x00)
		{
			//临时控制有效标志
			u8TempCtrlChange = 1;
			pstCtrl_Info->u8TempRationFlag = 0x01;
			//更新临时限电起始时间
			MemCopy(&pstCtrl_Info->stTempRationStartTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
			MemCopy(&pstCtrl_PowerDown_Save_Info->stTempRationStartTime,&stSysCurrTime,sizeof(TIME_PARAM_S));
		}
	}
	else
	{
		if(pstCtrl_Info->u8TempRationPowerUpFlag == 0)
		{
			pstCtrl_Info->u8TempRationPowerUpFlag = 1;
		}
		if(pstCtrl_Info->u8TempRationFlag == 0x01)
		{
			u8TempCtrlChange = 1;			
		}
		pstCtrl_Info->u8TempRationFlag = 0;
	}
	//更新临时限电指标
	pstCtrl_Info->u8TempRationFloatCoeff = (u8)(pstCtrl_Param_Info->E0000C70>>16);	
	//更新临时限电时间
	u8Time_Min = QCSG_BCD2HEX((u8)pstCtrl_Param_Info->E0000C70);
	u8Time_Hour = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000C70>>8));
	pstCtrl_Info->u32TempRation_Time = u8Time_Hour * 3600 + u8Time_Min * 60;
	if(QCSG_BCDCheck((u8*)&pstCtrl_Param_Info->E0000C6D,4) != TRUE)
	{
		//如果最低负荷没有设置，不进行临时控处理
		pstCtrl_Info->u8TempRationFlag = 0;
	}
	else
	{
		u32LimitPower = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000C6D >> 24)) * 1000000
									+ QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000C6D >> 16)) * 10000
									+ QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000C6D >> 8)) * 100
									+ QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->E0000C6D));
		pstCtrl_Info->u32LimitPower = u32LimitPower;
	}
	//更新功率控制滑差时间
	if(QCSG_BCDCheck(&pstCtrl_Param_Info->E0000C71,1) != TRUE)
	{
		pstCtrl_Info->u8SlipTime = 15;
	}
	else
	{
		pstCtrl_Info->u8SlipTime = QCSG_BCD2HEX(pstCtrl_Param_Info->E0000C71);
		if((pstCtrl_Info->u8SlipTime > 15) || (pstCtrl_Info->u8SlipTime == 0))
		{
			pstCtrl_Info->u8SlipTime = 15;
		}
	}
#if defined(FKGA43_CL3200_TEST)
	//过CL3200南网台体，滑差时间更改为固定1分钟。
	pstCtrl_Info->u8SlipTime = 1;
#endif
	/**************************************临时控参数结束***************************************************/
	/**************************************时段控参数更新***************************************************/
	//更新功控有效标志
	pstCtrl_Info->u8PowerCtrlFlag = pstCtrl_Param_Info->PowerCtrlFlag;
	//过负荷持续时间
	if(QCSG_BCDCheck((u8*)&pstCtrl_Param_Info->PowerOverLoadTime,4) != TRUE)
	{
		pstCtrl_Info->u32PowerOccurTimeout = 10 * 60 * 100;
	}
	else
	{
		pstCtrl_Info->u32PowerOccurTimeout = QCSG_BCD2HEX(pstCtrl_Param_Info->PowerOverLoadTime) * 60 * 100;
	}
	//负荷恢复时间
	if(QCSG_BCDCheck((u8*)&pstCtrl_Param_Info->PowerResetTime,4) != TRUE)
	{
		pstCtrl_Info->u32PowerRestoreTimeout = 10 * 60 * 100;
	}
	else
	{
		pstCtrl_Info->u32PowerRestoreTimeout = QCSG_BCD2HEX(pstCtrl_Param_Info->PowerResetTime) * 60 * 100;
	}
	//功率定值浮动系数
	u8FloatCoeff = pstCtrl_Param_Info->E0000C6B & 0x7F;
	if(QCSG_BCDCheck(&u8FloatCoeff,1) != TRUE)
	{
		pstCtrl_Info->u8PowerFloatCoeff = 0;
	}
	else
	{
		pstCtrl_Info->u8PowerFloatCoeff = pstCtrl_Param_Info->E0000C6B;
	}
	if(memcmp(&pstCtrl_Info->stKwCtrl[0],&pstCtrl_Param_Info->KwCtrl[0],sizeof(KwCtrlStruct) * 4) != 0)
	{
		u8TimeCtrlChange = 1;
	}
	MemCopy(&pstCtrl_Info->stKwCtrl[0],&pstCtrl_Param_Info->KwCtrl[0],sizeof(KwCtrlStruct) * 4);
	/**************************************时段控参数结束***************************************************/
	/**************************************厂休控参数更新***************************************************/
	//更新厂休控有效标志
	pstCtrl_Info->u8FactoryRestFlag = pstCtrl_Param_Info->E0000E10;
	/**************************************厂休控参数结束***************************************************/
	/**************************************功控公共参数更新*************************************************/	
	//功控累加标志
	if(pstCtrl_Info->u8PowerSumFlag != pstCtrl_Param_Info->PowerCtrlIncFlag)
	{
		u8TempCtrlChange = 1;
		u8TimeCtrlChange = 1;
	}
	pstCtrl_Info->u8PowerSumFlag = pstCtrl_Param_Info->PowerCtrlIncFlag;
	//功控总加组
	if(memcmp(pstCtrl_Info->u16PowerSumPnList, pstCtrl_Param_Info->PowerCtrlPoint, sizeof(pstCtrl_Info->u16PowerSumPnList)) != 0)
	{
		u8TempCtrlChange = 1;
		u8TimeCtrlChange = 1;
	}
	MemCopy(pstCtrl_Info->u16PowerSumPnList, pstCtrl_Param_Info->PowerCtrlPoint, sizeof(pstCtrl_Info->u16PowerSumPnList));
	//功控轮次有效标志
	if(pstCtrl_Info->u8PowerCtrl_RoundFlag != (pstCtrl_Param_Info->PowerCtrlRoundFlag & 0x0F))
	{
		u8TempCtrlChange = 1;
		u8TimeCtrlChange = 1;
	}
	pstCtrl_Info->u8PowerCtrl_RoundFlag = (pstCtrl_Param_Info->PowerCtrlRoundFlag & 0x0F);
	/**************************************功控公共参数结束*************************************************/
	if(u8EnergyChange == 1)
	{
		pstCtrl_Info->u32EnergyAlarmTimeoutTick = 0;
		pstCtrl_Info->u8EnergyAlarmFlag = 0;
		pstCtrl_Info->u8EnergyCtrlSwitchState = 0;
		pstCtrl_PowerDown_Save_Info->u32OverLimitEnergy = 0;
		pstCtrl_PowerDown_Save_Info->u32RationEnergy = 0;		
	}
	if(u8TimeCtrlChange == 1)
	{
		//时段控参数变更
		if((pstCtrl_Info->u8PowerCtrlFlag == 1) && (pstCtrl_Info->u8TempRationFlag == 0))
		{
			pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
			pstCtrl_Info->u8PowerAlarmFlag = 0;
			pstCtrl_Info->u8PowerCtrlSwitchState = 0;				
		}
		pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;					
	}
	if(u8TempCtrlChange == 1)
	{
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;	
		pstCtrl_Info->u8SlipTimeoutFlag = 0;
		MemSet(pstCtrl_Info->s32MinutePowerList,0,sizeof(pstCtrl_Info->s32MinutePowerList));
	}
	if((pstCtrl_Info->u8TempRationFlag == 1) || (pstCtrl_Info->u8PowerCtrlFlag == 1))
	{
		pstCtrl_Info->u8LedState |= LED_POWERCTRL;
	}
	if(pstCtrl_Info->u8EnergyCtrlFlag == 1)
	{
		pstCtrl_Info->u8LedState |= LED_ENERGYCTRL;
	}		
}
/**--------------------------------------------------------------------
*功    能:更新控制结构体信息
*输入参数:pstCtrl_Param_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void RealTime_Update_Ctrl_Info(LoadManagementParaStruct* pstCtrl_Param_Info,QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u8 u8Time_Hour = 0,u8Time_Min = 0;
	u32 u32ReadLen = 0,u32CurrTick = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	//门节点属性实时更新
	if(QCSG_GetDIChange(DI_E0000C00) == TRUE)	//如果参数有设置过
	{
		//为过台体门节点防抖，需要立即获取上行协议该参数，周期更新时就不需要再更新此参数
		QCSG_NoticeDIChange(DI_E0000C00,FALSE);
		if(NAND_ReadPara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen) != NO_ERROR)
		{
			return;
		}	
		//更新遥信开关属性
		if((pstCtrl_Param_Info->SwitchNodeType[0] != 0x00) && (pstCtrl_Param_Info->SwitchNodeType[0] != 0x01))
		{
			pstCtrl_Info->u8Switch0Attr = 0x00;
		}
		else
		{
			if(pstCtrl_Info->u8Switch0Attr != pstCtrl_Param_Info->SwitchNodeType[0])
			{
				pstCtrl_Info->u32Switch0Timeout = u32CurrTick + 30 * 100;
			}
			pstCtrl_Info->u8Switch0Attr = pstCtrl_Param_Info->SwitchNodeType[0];
		}
	}
	//保电状态实时更新
	if(QCSG_GetDIChange(DI_E0000C50) == TRUE)
	{
		QCSG_NoticeDIChange(DI_E0000C50,FALSE);	
		if(NAND_ReadPara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen) != NO_ERROR)
		{
			return;
		}
#if (TEST_ON == 0)//err20180628 保电测试修改
		pstCtrl_Info->u8PowerHoldState = pstCtrl_Param_Info->PowerHoldState;//为过台体保电测试，不能实时更新。在Update_Ctrl_Info中进行1min更新一次
#endif
	}	
	//远程遥控状态实时更新
	if((QCSG_GetDIChange(DI_E0000C2F) == TRUE) ||(QCSG_GetDIChange(DI_E0000C40) == TRUE))
	{
		if(QCSG_GetDIChange(DI_E0000C2F) == TRUE)
		{
			QCSG_NoticeDIChange(DI_E0000C2F,FALSE);	
		}
		if(QCSG_GetDIChange(DI_E0000C40) == TRUE)
		{
			QCSG_NoticeDIChange(DI_E0000C40,FALSE);	
		}
		if(NAND_ReadPara(PARA_LoadManagement,0,0xE0000C00,(u8*)pstCtrl_Param_Info,&u32ReadLen) != NO_ERROR)
		{
			return;
		}
		//更新远程遥控状态
		if(((pstCtrl_Param_Info->OutputSwitchState[1] != 0)&&(pstCtrl_Param_Info->OutputSwitchState[1] != 1)) || (pstCtrl_Param_Info->OutputSwitchState[1] == 0))
		{
			pstCtrl_Info->u8YKSwitchOutState &= 0xFE;
		}
		if(((pstCtrl_Param_Info->OutputSwitchState[2] != 0)&&(pstCtrl_Param_Info->OutputSwitchState[2] != 1)) || (pstCtrl_Param_Info->OutputSwitchState[2] == 0))
		{
			pstCtrl_Info->u8YKSwitchOutState &= 0xFD;
		}	
		if(((pstCtrl_Param_Info->OutputSwitchState[3] != 0)&&(pstCtrl_Param_Info->OutputSwitchState[3] != 1)) || (pstCtrl_Param_Info->OutputSwitchState[3] == 0))
		{
			pstCtrl_Info->u8YKSwitchOutState &= 0xFB;
		}
		if(((pstCtrl_Param_Info->OutputSwitchState[4] != 0)&&(pstCtrl_Param_Info->OutputSwitchState[4] != 1)) || (pstCtrl_Param_Info->OutputSwitchState[4] == 0))
		{
			pstCtrl_Info->u8YKSwitchOutState &= 0xF7;
		}
		if(pstCtrl_Param_Info->OutputSwitchState[1] == 1)
		{
			pstCtrl_Info->u8YKSwitchOutState |= 0x01;
		}
		if(pstCtrl_Param_Info->OutputSwitchState[2] == 1)
		{
			pstCtrl_Info->u8YKSwitchOutState |= 0x02;
		}
		if(pstCtrl_Param_Info->OutputSwitchState[3] == 1)
		{
			pstCtrl_Info->u8YKSwitchOutState |= 0x04;
		}
		if(pstCtrl_Param_Info->OutputSwitchState[4] == 1)
		{
			pstCtrl_Info->u8YKSwitchOutState |= 0x08;
		}
		pstCtrl_Info->u8YKSwitchOutState &= 0x0F;
		//更新遥控轮次，没有按照协议轮次，协议设置轮次可能与型式规范轮次对不起来，以型式规范为准，轮次与输出开关配置保持一致
		pstCtrl_Info->u8YKCtrl_RoundFlag = pstCtrl_Info->u8YKSwitchOutState;
		//更新遥控关闭时间
		if(QCSG_BCDCheck((u8*)&pstCtrl_Param_Info->RemoteSwitchOffTime,2) != TRUE)
		{
			pstCtrl_Info->u32YK_Timeout = 0;			
		}
		else
		{
			if(QCSG_BCDCheck((u8*)&pstCtrl_Param_Info->RemoteSwitchOffTime,2) != TRUE)
			{
				pstCtrl_Info->u32YK_Timeout = 0;
			}
			else if(pstCtrl_Param_Info->RemoteSwitchOffTime == 0)
			{
				pstCtrl_Info->u32YK_Timeout = 0;
			}
			else
			{
				u8Time_Min = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->RemoteSwitchOffTime));
				u8Time_Hour = QCSG_BCD2HEX((u8)(pstCtrl_Param_Info->RemoteSwitchOffTime>>8));
				pstCtrl_Info->u32YK_Timeout = u32CurrTick + u8Time_Hour * 60 * 60 * 100 + u8Time_Min * 60 * 100;				
			}
		}
/*		
		pstCtrl_Info->u8YKCtrlSwitchState = 0;	
		pstCtrl_Info->u8YKAlarmFlag = 0;
		pstCtrl_Info->u32YKAlarmTimeoutTick = 0;
*/		
	}
}
/**--------------------------------------------------------------------
*功    能:获取测量点有功功率
*输入参数:u16Pn
*输出参数:ps32Power
*返    回:是否获取到
--------------------------------------------------------------------**/
u8 Get_Mp_Power(u16 u16Pn,s32* ps32Power)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	s32 s32Temp_Power = 0;
	u8 u8PnNum = 0,i = 0;
	
	u8PnNum = pstPn_Ram_Data->u8PnNum;
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
		{
			pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return FALSE;
	}
	if(QCSG_BCDCheck(pstRam_Data->u8Data0203FF00,3) != TRUE)
	{
		return FALSE;
	}
	MemCopy(&s32Temp_Power,pstRam_Data->u8Data0203FF00,3);
	if((s32Temp_Power & 0x00800000) != 0)
	{
		//功率为负数,灭掉符号位
		s32Temp_Power &= 0x7FFFFF;
		s32Temp_Power = QCSG_BCD2HEX((u8)(s32Temp_Power>>16)) * 10000 + QCSG_BCD2HEX((u8)(s32Temp_Power>>8)) * 100
						+ QCSG_BCD2HEX((u8)s32Temp_Power);
		s32Temp_Power = s32Temp_Power * (-1);
		
