gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
	}
	else
	{
		s32Temp_Power = QCSG_BCD2HEX((u8)(s32Temp_Power>>16)) * 10000 + QCSG_BCD2HEX((u8)(s32Temp_Power>>8)) * 100
						+ QCSG_BCD2HEX((u8)s32Temp_Power);		
	}
	(*ps32Power) = s32Temp_Power;
	return TRUE;
}
/**--------------------------------------------------------------------
*功    能:计算滑差功率
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:是否有测量点参与计算功率
--------------------------------------------------------------------**/
u8 Calc_Mp_SlipPower(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	MeasurePointStruct stPnPara;
	u8 i = 0,u8Pn_Flag = 0,u8Index = 0;
	s8 s8Sign = 1;
	u16 u16Pn = 0;
	u32 u32CurrTick = 0,u32ReadLen = 0;
	s32 s32Power = 0,s32SumPower = 0,s32SlipPower = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	// 1min获取一次测量点功率，不到1min不处理
	if((u32CurrTick - pstCtrl_Info->u32SlipTick) < 6000)
	{
		return TRUE;
	}
	pstCtrl_Info->u32SlipTick = u32CurrTick;
	//计算测量点累加功率
	for(i = 0;i < 8;i++)
	{
		u16Pn = pstCtrl_Info->u16PowerSumPnList[i];
		if(u16Pn == 0xFFFF)
		{
			continue;
		}		
		u16Pn = (u16)SwitchNumToPn(pstCtrl_Info->u16PowerSumPnList[i]);
		u8Pn_Flag = 1;
		//获取测量点功率
		if(Get_Mp_Power(u16Pn,&s32Power) != TRUE)
		{
			continue;
		}
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			continue;
		}
		if((stPnPara.CT == 0) || (stPnPara.PT == 0) || (stPnPara.CT == 0xFF) || (stPnPara.PT == 0xFF))
		{
			continue;
		}
		//获取该测量点累加标记，是加还是减
		if((pstCtrl_Info->u8PowerSumFlag & (1 << i)) == 0x00)
		{
			s8Sign = -1;
		}
		else
		{
			s8Sign = 1;
		}
		stPnPara.CT = QCSG_BCD2HEX((u8)(stPnPara.CT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.CT);
		stPnPara.PT = QCSG_BCD2HEX((u8)(stPnPara.PT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.PT);
		s32Power = s8Sign * s32Power * stPnPara.CT * stPnPara.PT;
		s32SumPower += s32Power;
	}
	if(u8Pn_Flag == 0)
	{
		return FALSE;
	}
	u8Index = pstCtrl_Info->u32SlipCnt % pstCtrl_Info->u8SlipTime;
	pstCtrl_Info->s32MinutePowerList[u8Index] = s32SumPower;
	pstCtrl_Info->u32SlipCnt++;
	if(pstCtrl_Info->u32SlipCnt <= pstCtrl_Info->u8SlipTime)
	{
		//未到一个滑差周期
		pstCtrl_Info->u8SlipTimeoutFlag = 0;
		return TRUE;
	}
	pstCtrl_Info->u8SlipTimeoutFlag = 1;
	pstCtrl_Info->u32SlipCnt = 0;
	//进行滑差功率计算
	for(i = 0;i < pstCtrl_Info->u8SlipTime;i++)
	{
		s32SlipPower += pstCtrl_Info->s32MinutePowerList[i];
	}
	s32SlipPower = s32SlipPower / pstCtrl_Info->u8SlipTime;
	pstCtrl_Info->s32SlipPower = s32SlipPower;
	return TRUE;
}
/**--------------------------------------------------------------------
*功    能:计算累加功率
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:是否有测量点参与计算功率
--------------------------------------------------------------------**/
u8 Calc_Mp_SumPower(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	MeasurePointStruct stPnPara;
	u8 i = 0,u8Pn_Flag = 0;
	s8 s8Sign = 1;
	u16 u16Pn = 0;
	u32 u32CurrTick = 0,u32ReadLen = 0;
	s32 s32Power = 0,s32SumPower = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	// 1 min获取一次测量点功率，不到1min不处理
	if((u32CurrTick - pstCtrl_Info->u32SumPowerTick) < 6000)
	{
		return TRUE;
	}
	pstCtrl_Info->u32SumPowerTick = u32CurrTick;
	//计算测量点累加功率
	for(i = 0;i < 8;i++)
	{
		u16Pn = pstCtrl_Info->u16PowerSumPnList[i];		
		if(u16Pn == 0xFFFF)
		{
			continue;
		}
		u16Pn = (u16)SwitchNumToPn(pstCtrl_Info->u16PowerSumPnList[i]);
		u8Pn_Flag = 1;
		//获取测量点功率
		if(Get_Mp_Power(u16Pn,&s32Power) != TRUE)
		{
			continue;
		}
		if(NAND_ReadMeasurePoint(u16Pn,0xE0800000,(u8*)&stPnPara,&u32ReadLen) != NO_ERROR)
		{
			continue;
		}
		if((stPnPara.CT == 0) || (stPnPara.PT == 0) || (stPnPara.CT == 0xFF) || (stPnPara.PT == 0xFF))
		{
			continue;
		}
		//获取该测量点累加标记，是加还是减
		if((pstCtrl_Info->u8PowerSumFlag & (1 << i)) == 0x00)
		{
			s8Sign = -1;
		}
		else
		{
			s8Sign = 1;
		}
		stPnPara.CT = QCSG_BCD2HEX((u8)(stPnPara.CT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.CT);
		stPnPara.PT = QCSG_BCD2HEX((u8)(stPnPara.PT>>8)) * 100 + QCSG_BCD2HEX((u8)stPnPara.PT);
		s32Power = s8Sign * s32Power * stPnPara.CT * stPnPara.PT;
		s32SumPower += s32Power;
	}
	if(u8Pn_Flag == 0)
	{
		return FALSE;
	}
	pstCtrl_Info->s32SumPower = s32SumPower;
	return TRUE;
}
/**--------------------------------------------------------------------
*功    能:判断当前时间是否在控制时段内
*输入参数:pstCtrl_Info
*输出参数:pu32LimitValue
*返    回:时段是否有效
--------------------------------------------------------------------**/
u8 Judge_Ctrl_TimeInterval(QCSG_CTRL_INFO_S* pstCtrl_Info,u32* pu32LimitValue)
{
	TIME_PARAM_S stStartTime,stEndTime,stCurrTime;
	KwCtrlStruct stTimeCtrl_Info;
	u8 i = 0,j = 0,u8Res = FALSE,u8ValidFlag = FALSE,u8Pos = 0;
	u16 u16Smd = 0,u16Emd = 0,u16Shm = 0,u16Ehm = 0,u16Currhm = 0;
	u32 u32Res[4],u32DateFlag = 0;
	
	MemSet(&stStartTime,0,sizeof(TIME_PARAM_S));
	MemSet(&stEndTime,0,sizeof(TIME_PARAM_S));
	MemSet(&stCurrTime,0,sizeof(TIME_PARAM_S));
	for(i = 0;i < 4; i++)	// 4个功率控制集合
	{
		HAL_GetSystemTime(&stCurrTime);
		MemCopy(&stTimeCtrl_Info,&pstCtrl_Info->stKwCtrl[i],sizeof(KwCtrlStruct));
		if(QCSG_BCDCheck(&stTimeCtrl_Info.StartMonth,1) != TRUE)
		{
			continue;
		}
		if(QCSG_BCDCheck(&stTimeCtrl_Info.StartDay,1) != TRUE)
		{
			continue;
		}	
		if(QCSG_BCDCheck(&stTimeCtrl_Info.EndMonth,1) != TRUE)
		{
			continue;
		}
		if(QCSG_BCDCheck(&stTimeCtrl_Info.EndDay,1) != TRUE)
		{
			continue;
		}				
		//---------------------控制时间判断---------------------
		stStartTime.u8Year = stCurrTime.u8Year;
		u16Smd = stTimeCtrl_Info.StartMonth * 0x100 + stTimeCtrl_Info.StartDay;
		u16Emd = stTimeCtrl_Info.EndMonth * 0x100 + stTimeCtrl_Info.EndDay;
		if(u16Smd > u16Emd)
		{
			//防止配置的起始时间及结束时间跨年
			stEndTime.u8Year = QCSG_IncBCD(stCurrTime.u8Year);
		}
		else
		{
			stEndTime.u8Year = stCurrTime.u8Year;
		}
		stStartTime.u8Month = stTimeCtrl_Info.StartMonth;
		stStartTime.u8Day = stTimeCtrl_Info.StartDay;
		stEndTime.u8Month = stTimeCtrl_Info.EndMonth;
		stEndTime.u8Day = stTimeCtrl_Info.EndDay;
		if((QCSG_TimerSub(&stCurrTime,&stStartTime,u32Res) < 0) || (QCSG_TimerSub(&stCurrTime,&stEndTime,u32Res) > 0))
		{
			//小于起始时间，大于结束时间，说明时间未到，继续寻找下一个时段
			continue;
		}
		//在执行日期内，根据执行周期判断当天是否需要控制
		if((stTimeCtrl_Info.TI != 0x04)&&(stTimeCtrl_Info.TI != 0x05)&&(stTimeCtrl_Info.TI != 0x06))
		{
			//周期配置不正确
			continue;
		}
		switch(stTimeCtrl_Info.TI)
		{
			case 0x04:	//日
				if(stCurrTime.u8Day == stStartTime.u8Day)	//刚好当天是起始时间，即第一次执行
				{
					u8ValidFlag = TRUE;					
				}
				else
				{
					if(stTimeCtrl_Info.N0 == 1||stTimeCtrl_Info.N0 == 0)	//每日执行,N0=0的情况也归到这里，否则死循环
					{
						u8ValidFlag = TRUE;					
					}
					else
					{
						while(1)
						{
							for(j = 0;j < stTimeCtrl_Info.N0;j++)
							{
								QCSG_IncOneDay(&stStartTime);	//起始时间再过N0天后，是否为当前日
							}
							if((stCurrTime.u8Month == stStartTime.u8Month) && (stCurrTime.u8Day == stStartTime.u8Day))
							{
								u8ValidFlag = TRUE;	
								break;
							}
							if(QCSG_TimerSub(&stStartTime,&stEndTime,u32Res) >= 0)
							{
								//时间已经大于结束时间
								u8ValidFlag = FALSE;	
								break;
							}
						}
					}
				}
				break;
			case 0x06:	//周
				u32DateFlag = stTimeCtrl_Info.N0;
				u8Pos = QCSG_BCD2HEX(stCurrTime.u8Week);
				if(((u32DateFlag >> u8Pos) & 0x01) != 0)
				{
					u8ValidFlag = TRUE;
				}
				break;
			case 0x05:	//月
				u32DateFlag = stTimeCtrl_Info.N3 * 0x1000000 
							+ stTimeCtrl_Info.N2 * 0x10000
							+ stTimeCtrl_Info.N1 * 0x100
							+ stTimeCtrl_Info.N0;
				u8Pos = QCSG_BCD2HEX(stCurrTime.u8Day);
				if(((u32DateFlag >> (u8Pos -1)) & 0x01) != 0)
				{
					u8ValidFlag = TRUE;
				}
				break;
		}
		if(u8ValidFlag == FALSE)
		{
			continue;
		}
		//---------------------控制时段判断---------------------
		u8Res = FALSE;
		for(j = 0;j < stTimeCtrl_Info.PowerCtrlPeriodCnt;j++)
		{
			if(stTimeCtrl_Info.Option[j].EffectiveFlag != 0x01)
			{
				//该时段控制解除
				continue;
			}
			if( j == (stTimeCtrl_Info.PowerCtrlPeriodCnt -1))
			{
				u16Shm = stTimeCtrl_Info.Option[j].StartHour * 0x100 + stTimeCtrl_Info.Option[j].StartMinute;
				u16Ehm = 0x2400;
			}
			else
			{
				u16Shm = stTimeCtrl_Info.Option[j].StartHour * 0x100 + stTimeCtrl_Info.Option[j].StartMinute;
				u16Ehm = stTimeCtrl_Info.Option[j + 1].StartHour * 0x100 + stTimeCtrl_Info.Option[j + 1].StartMinute;;				
			}
			if(u16Ehm < u16Shm)
			{
				//结束时间小于开始时间
				continue;
			}
			u16Currhm = stCurrTime.u8Hour * 0x100 + stCurrTime.u8Minute;
			if((u16Currhm > u16Shm)&&(u16Currhm < u16Ehm))
			{
				u8Res = TRUE;
				break;
			}
		}
		if(u8Res != TRUE)
		{
			continue;
		}
		if(stTimeCtrl_Info.Option[j].EffectiveFlag == 1)
		{
			(*pu32LimitValue) = stTimeCtrl_Info.Option[j].PowerLoad;
			break;
		}
	}
	return u8Res;
}
/**--------------------------------------------------------------------
*功    能:远程遥控
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void YK_Ctrl_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u32 u32CurrTick = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	if((pstCtrl_Info->u8YKSwitchOutState == 0) && (pstCtrl_Info->u8YKCtrlSwitchState == 0))
	{
		return;
	}
	if((pstCtrl_Info->u8YKCtrl_RoundFlag == 0) && (pstCtrl_Info->u8YKCtrlSwitchState == 0))
	{
		return;
	}
	if(pstCtrl_Info->u32YK_Timeout != 0)
	{
		//控制时间到，放开遥控
		if(u32CurrTick >= pstCtrl_Info->u32YK_Timeout)
		{
			pstCtrl_Info->u8YKCtrlSwitchState = 0;
			return;
		}
	}
	if(pstCtrl_Info->u32YKAlarmTimeoutTick == 0)
	{
		if(pstCtrl_Info->u8YKCtrlSwitchState != pstCtrl_Info->u8YKCtrl_RoundFlag)
		{
			pstCtrl_Info->u8YKAlarmFlag = 1;
			pstCtrl_Info->u32YKAlarmTimeoutTick = u32CurrTick;		
		}
	}
}
/**--------------------------------------------------------------------
*功    能:临时限电控
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Power_Ctrl_TempRation(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	TIME_PARAM_S stSysCurrTime,stTempRationEndTime;
	u8 u8FloatCoeff = 0;
	u32 u32CurrTick = 0,u32LimitPower = 0,u32Res[4];
	s8 s8Res = 0;
	s32 s32SlipPower = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	HAL_GetSystemTime(&stSysCurrTime);
	QCSG_TimerAdd(&pstCtrl_Info->stTempRationStartTime,pstCtrl_Info->u32TempRation_Time,&stTempRationEndTime);
	s8Res = QCSG_TimerSub(&stSysCurrTime,&stTempRationEndTime,u32Res);
	if(s8Res >= 0)
	{
		//当前时间已经大于临时控制的结束时间，清除终端控制状态
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;		
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;
		pstCtrl_Info->u8SlipTimeoutFlag = 0;
		return;		
	}
	s8Res = QCSG_TimerSub(&stSysCurrTime,&pstCtrl_Info->stTempRationStartTime,u32Res);
	if(s8Res < 0)	
	{
		//当前时间小于临时控制的开始时间，此操作为设置控制后，给负控往回校时，只有测试时会出现此现象
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;		
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;	
		pstCtrl_Info->u8SlipTimeoutFlag = 0;		
	}
	if(pstCtrl_Info->u32PowerAlarmTimeoutTick != 0)
	{
		//还在告警阶段，不进行后续处理
		return;
	}
	if(Calc_Mp_SlipPower(pstCtrl_Info) != TRUE)
	{
		//没有测量点参与滑差计算
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;			
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;	
		pstCtrl_Info->u8SlipTimeoutFlag = 0;		
		return;
	}
	if(pstCtrl_Info->u8SlipTimeoutFlag == 0)
	{
		//滑差周期未到，不进行后续处理
		return;
	}
	pstCtrl_Info->u8SlipTimeoutFlag = 0;
	//获取浮动系数，X%。
	u8FloatCoeff = pstCtrl_Info->u8TempRationFloatCoeff;
	u8FloatCoeff = 100 + QCSG_BCD2HEX(u8FloatCoeff);
	//pstCtrl_Info->u32LimitPower:NNNNNN.NN,扩大100倍，u8FloatCoeff：X%,扩大100倍
	u32LimitPower = pstCtrl_Info->u32LimitPower;
	u32LimitPower = u32LimitPower * u8FloatCoeff;
	//pstCtrl_Info->s32SlipPower:NN.NNNN,扩大10000倍
	s32SlipPower = pstCtrl_Info->s32SlipPower;
	if(s32SlipPower < 0)
	{
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;	
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;	
	}
	else
	{
		if(s32SlipPower > u32LimitPower)
		{
			//功率超过设置定值，开始告警，准备继电器动作
			if(pstCtrl_Info->u32PowerAlarmTimeoutTick == 0)
			{
				//告警计时器初值为0，说明当前没在进行告警，则初始化告警标志
				if(pstCtrl_Info->u8PowerCtrlSwitchState != pstCtrl_Info->u8PowerCtrl_RoundFlag)
				{
					pstCtrl_Info->u8PowerAlarmFlag = 1;
					pstCtrl_Info->u32PowerAlarmTimeoutTick = u32CurrTick;
				}						
			}
		}
		else
		{
			pstCtrl_Info->u8PowerAlarmFlag = 0;
			pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;	
			pstCtrl_Info->u8PowerCtrlSwitchState = 0;						
		}
	}
}
/**--------------------------------------------------------------------
*功    能:厂休控
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Power_Ctrl_FactoryRest(QCSG_CTRL_INFO_S* pstCtrl_Info)
{

