gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
}
/**--------------------------------------------------------------------
*功    能:时段控
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Power_Ctrl_TimeInterval(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u8 u8FloatCoeff = 0;
	u32 u32CurrTick = 0,u32LimitPower = 0;
	s32 s32SumPower = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	if(Judge_Ctrl_TimeInterval(pstCtrl_Info,&u32LimitPower) != TRUE)
	{
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;
		pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;	
		return;
	}
	if(Calc_Mp_SumPower(pstCtrl_Info) != TRUE)
	{
		//没有测量点参与滑差计算，清除终端控制状态	
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;	
		pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;			
		return;
	}
	//获取浮动系数，X%。
	u8FloatCoeff = pstCtrl_Info->u8PowerFloatCoeff & 0x7F;
	if((pstCtrl_Info->u8PowerFloatCoeff & 0x80) == 0)
	{
		u8FloatCoeff = 100 + QCSG_BCD2HEX(u8FloatCoeff);
	}
	else
	{
		u8FloatCoeff = 100 - QCSG_BCD2HEX(u8FloatCoeff);
	}
	//u32LimitPower:NNNNNN.NN,扩大100倍，u8FloatCoeff：X%,扩大100倍
	u32LimitPower = QCSG_BCD2HEX((u8)(u32LimitPower >> 24)) * 1000000 + QCSG_BCD2HEX((u8)(u32LimitPower >> 16)) * 10000
					+ QCSG_BCD2HEX((u8)(u32LimitPower >> 8)) * 100 + QCSG_BCD2HEX((u8)u32LimitPower);
	u32LimitPower = u32LimitPower * u8FloatCoeff;
	//pstCtrl_Info->s32SlipPower:NN.NNNN,扩大10000倍
	s32SumPower = pstCtrl_Info->s32SumPower;
	if(s32SumPower < 0)
	{
		if(pstCtrl_Info->u8PowerCtrlStep != POWER_RESTORE_STEP)
		{
			pstCtrl_Info->u8PowerCtrlStep = POWER_RESTORE_STEP;
			pstCtrl_Info->u32PowerRestoreTimeoutTick = u32CurrTick;

		}
		else
		{
			if((u32CurrTick - pstCtrl_Info->u32PowerRestoreTimeoutTick) > pstCtrl_Info->u32PowerRestoreTimeout)
			{
				pstCtrl_Info->u8PowerAlarmFlag = 0;
				pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;	
				pstCtrl_Info->u8PowerCtrlSwitchState = 0;		
				pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;	
			}				
		}
	}
	else
	{
		if(s32SumPower > u32LimitPower)
		{
			//功率超过设置定值，开始告警，准备继电器动作
			if(pstCtrl_Info->u32PowerAlarmTimeoutTick == 0)
			{
				//告警计时器初值为0，说明当前没在进行告警，则初始化告警标志
				if(pstCtrl_Info->u8PowerCtrlStep != POWER_OCCUR_STEP)
				{
					pstCtrl_Info->u8PowerCtrlStep = POWER_OCCUR_STEP;
					pstCtrl_Info->u32PowerOccurTimeoutTick = u32CurrTick;
				}
				else
				{
					if((u32CurrTick - pstCtrl_Info->u32PowerOccurTimeoutTick) > pstCtrl_Info->u32PowerOccurTimeout)
					{
						if(pstCtrl_Info->u8PowerCtrlSwitchState != pstCtrl_Info->u8PowerCtrl_RoundFlag)
						{
							pstCtrl_Info->u8PowerAlarmFlag = 1;
							pstCtrl_Info->u32PowerAlarmTimeoutTick = u32CurrTick;
							pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;	
						}						
					}
				}
			}
		}
		else
		{
			if(pstCtrl_Info->u8PowerCtrlStep != POWER_RESTORE_STEP)
			{
				pstCtrl_Info->u8PowerCtrlStep = POWER_RESTORE_STEP;
				pstCtrl_Info->u32PowerRestoreTimeoutTick = u32CurrTick;

			}
			else
			{
				if((u32CurrTick - pstCtrl_Info->u32PowerRestoreTimeoutTick) > pstCtrl_Info->u32PowerRestoreTimeout)
				{
					pstCtrl_Info->u8PowerAlarmFlag = 0;
					pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;	
					pstCtrl_Info->u8PowerCtrlSwitchState = 0;		
					pstCtrl_Info->u8PowerCtrlStep = POWER_IDLE_STEP;	
				}				
			}
		}	
	}	
}
/**--------------------------------------------------------------------
*功    能:南网功率控制处理，临时限电控>厂休控>时段控
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Power_Ctrl_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{	
	if((pstCtrl_Info->u8PowerCtrlFlag != 0x01) && (pstCtrl_Info->u8TempRationFlag != 0x01))
	{
		//功率控制无效,关闭功控灯
		pstCtrl_Info->u8LedState &= (~LED_POWERCTRL);
		//清空告警相关变量
		pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
		pstCtrl_Info->u8PowerAlarmFlag = 0;
		pstCtrl_Info->u8PowerCtrlSwitchState = 0;	
		pstCtrl_Info->u32SlipCnt = 0;
		pstCtrl_Info->s32SlipPower = 0;	
		pstCtrl_Info->u8SlipTimeoutFlag = 0;		
		return;
	}
	//点亮功控灯
	pstCtrl_Info->u8LedState |= LED_POWERCTRL;
	if(pstCtrl_Info->u8PowerCtrl_RoundFlag == 0)
	{
		//功控各轮次都无效
		return;
	}
/*
	if(pstCtrl_Info->u8TempRationFlag == 0x01)
	{
		//临时限电控投入
		Power_Ctrl_TempRation(pstCtrl_Info);
	}
	else if(pstCtrl_Info->u8FactoryRestFlag == 0x01)
	{
		//厂休控投入
		Power_Ctrl_FactoryRest(pstCtrl_Info);
	}
	else if(pstCtrl_Info->u8PowerCtrlFlag == 0x01)
	{
		//时段控
		Power_Ctrl_TimeInterval(pstCtrl_Info);
	}
*/
	if(pstCtrl_Info->u8TempRationFlag == 0x01)
	{
		//临时限电控投入
		Power_Ctrl_TempRation(pstCtrl_Info);
	}
	else if(pstCtrl_Info->u8PowerCtrlFlag == 0x01)
	{
		//时段控
		Power_Ctrl_TimeInterval(pstCtrl_Info);
	}
}
/**--------------------------------------------------------------------
*功    能:获取测量点正向有功总电能
*输入参数:u16Pn
*输出参数:pu32Energy
*返    回:是否获取到
--------------------------------------------------------------------**/
u8 Get_Mp_Energy(u16 u16Pn,u32* pu32Energy)
{
	QCSG_MONTH_ENERGY_LIST_S* pst_Month_Energy_List = (QCSG_MONTH_ENERGY_LIST_S*)QCSG_MONTH_ENERGY_LIST_CTRL;
	QCSG_ENERGY_S* pstEnergy_Data = NULL;
	u32 u32Temp_Energy = 0;
	u8 u8PnNum = 0,i = 0;
	
	u8PnNum = pst_Month_Energy_List->u8PnNum;
	if(u8PnNum > MAX_PN_NUM)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));
	}
	for(i = 0;i < MAX_PN_NUM;i++)
	{
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u32Energy00010000,4) != TRUE)
		{
			break;
		}
		if(QCSG_BCDCheck((u8*)&pst_Month_Energy_List->stPn_Ram_Data[i].u16Pn,1) != TRUE)
		{
			break;
		}		
	}
	if(i < MAX_PN_NUM)
	{
		MemSet(pst_Month_Energy_List,0,sizeof(QCSG_MONTH_ENERGY_LIST_S));		
	}	
	for(i = 0;i < u8PnNum;i++)
	{
		//寻找内存中记录的测量点数据信息
		if(u16Pn == pst_Month_Energy_List->stPn_Ram_Data[i].u16Pn)
		{
			pstEnergy_Data = &pst_Month_Energy_List->stPn_Ram_Data[i];
			break;
		}
	}	
	if(i >= u8PnNum)
	{
		return FALSE;
	}	
	if(QCSG_BCDCheck((u8*)&pstEnergy_Data->u32Energy00010000,4) != TRUE)
	{
		return FALSE;
	}
	u32Temp_Energy = pstEnergy_Data->u32Energy00010000;
	u32Temp_Energy = QCSG_BCD2HEX((u8)(u32Temp_Energy>>24)) * 1000000 
				   + QCSG_BCD2HEX((u8)(u32Temp_Energy>>16)) * 10000 
				   + QCSG_BCD2HEX((u8)(u32Temp_Energy>>8)) * 100
				   + QCSG_BCD2HEX((u8)u32Temp_Energy);
	(*pu32Energy) = u32Temp_Energy;
	return TRUE;
}
/**--------------------------------------------------------------------
*功    能:计算总加组累计电量
*输入参数:pstCtrl_Info
*输出参数:pu32SumEnergy
*返    回:无
--------------------------------------------------------------------**/
u8 Calc_Mp_SumEnergy_Month(QCSG_CTRL_INFO_S* pstCtrl_Info,u32* pu32SumEnergy)
{
	u8 i = 0;
	s8 s8Sign = 1;
	u16 u16Pn = 0;
	u32 u32Energy = 0;
	s32 s32SumEnergy = 0;
	for(i = 0;i < 8;i++)
	{
		u16Pn = pstCtrl_Info->u16EnergySumPnList[i];
		if(u16Pn == 0xFFFF)
		{
			continue;
		}
		u16Pn = (u16)SwitchNumToPn(pstCtrl_Info->u16EnergySumPnList[i]);
		//获取测量点月电量
		if(Get_Mp_Energy(u16Pn,&u32Energy) != TRUE)
		{
			continue;
		}
		//获取该测量点累加标记，是加还是减
		if((pstCtrl_Info->u8EnergySumFlag & (1 << i)) == 0x00)
		{
			s8Sign = -1;
		}
		else
		{
			s8Sign = 1;
		}
		s32SumEnergy += (s8Sign * u32Energy);
	}		
	if(s32SumEnergy <= 0)
	{
		return FALSE;
	}
	(*pu32SumEnergy) = s32SumEnergy;
	return TRUE;
}
/**--------------------------------------------------------------------
*功    能:月电量控制处理
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Energy_Ctrl_Month(QCSG_CTRL_INFO_S* pstCtrl_Info,QCSG_CTRL_POWERDOWN_SAVE_INFO_S* pstCtrl_PowerDown_Save_Info)
{
	u8 u8FloatCoeff = 0;
	u32 u32Energy = 0,u32CurrTick = 0;

	u32CurrTick = HAL_GetSystemTick();
	if(pstCtrl_Info->u32EnergyAlarmTimeoutTick != 0)
	{
		return;
	}
	if(Calc_Mp_SumEnergy_Month(pstCtrl_Info,&u32Energy)==FALSE)
	{
		return;
	}
	//获取浮动系数，X%。
	u8FloatCoeff = pstCtrl_Info->u8EnergyFloatCoeff & 0x7F;
	if((pstCtrl_Info->u8EnergyFloatCoeff & 0x80) == 0)
	{
		u8FloatCoeff = 100 + QCSG_BCD2HEX(u8FloatCoeff);
	}
	else
	{
		u8FloatCoeff = 100 - QCSG_BCD2HEX(u8FloatCoeff);
	}	
	//u32Energy:NNNNNN.NN,扩大100倍，u8FloatCoeff：X%,扩大100倍
	if(pstCtrl_Info->u8EnergyCtrlSwitchState == 0)//如果没跳过闸，则判断电量是否超过月电量限额

	{
		if(u32Energy >= (pstCtrl_Info->u32MaxEnergy_Month * u8FloatCoeff))//月电量超过设置定值，开始告警，准备继电器动作
		{
			
			if(pstCtrl_Info->u32EnergyAlarmTimeoutTick == 0)//告警计时器初值为0，说明当前没在进行告警，则初始化告警标志
			{
				
