gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
				if(pstCtrl_Info->u8EnergyCtrlSwitchState != pstCtrl_Info->u8EnergyCtrl_RoundFlag)
				{
					pstCtrl_Info->u8EnergyAlarmFlag = 1;
					pstCtrl_Info->u32EnergyAlarmTimeoutTick = u32CurrTick;
					pstCtrl_PowerDown_Save_Info->u32OverLimitEnergy = u32Energy;
					pstCtrl_PowerDown_Save_Info->u32RationEnergy = 0;
				}
			}
		}
	}
	else
	{
		//如果已经跳过闸，则判断电量是否超过轮次电量
		if(u32Energy < pstCtrl_PowerDown_Save_Info->u32OverLimitEnergy)
		{
			return;
		}
		pstCtrl_PowerDown_Save_Info->u32RationEnergy = u32Energy - pstCtrl_PowerDown_Save_Info->u32OverLimitEnergy;
		if((pstCtrl_PowerDown_Save_Info->u32RationEnergy * 10) >= (pstCtrl_Info->u32RoundEnergy_Month * u8FloatCoeff))
		{
			//月轮次电量超过设置定值，开始告警，准备继电器动作
			if(pstCtrl_Info->u32EnergyAlarmTimeoutTick == 0)
			{
				//告警计时器初值为0，说明当前没在进行告警，则初始化告警标志
				if(pstCtrl_Info->u8EnergyCtrlSwitchState != pstCtrl_Info->u8EnergyCtrl_RoundFlag)
				{
					pstCtrl_Info->u8EnergyAlarmFlag = 1;
					pstCtrl_Info->u32EnergyAlarmTimeoutTick = u32CurrTick;
					pstCtrl_PowerDown_Save_Info->u32OverLimitEnergy = u32Energy;
					pstCtrl_PowerDown_Save_Info->u32RationEnergy = 0;
				}
			}			
		}
	}
}
/**--------------------------------------------------------------------
*功    能:南网电量控制处理
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Energy_Ctrl_Process(QCSG_CTRL_INFO_S* pstCtrl_Info,QCSG_CTRL_POWERDOWN_SAVE_INFO_S* pstCtrl_PowerDown_Save_Info)
{
	TIME_PARAM_S stSysCurrTime;
	
	HAL_GetSystemTime(&stSysCurrTime);
	if(pstCtrl_Info->u8EnergyCtrlFlag != 0x01)
	{
		//月电量控无效，关闭电控灯
		pstCtrl_Info->u8LedState &= (~LED_ENERGYCTRL);
		//清空告警相关变量
		pstCtrl_Info->u32EnergyAlarmTimeoutTick = 0;
		pstCtrl_Info->u8EnergyAlarmFlag = 0;
		pstCtrl_Info->u8EnergyCtrlSwitchState = 0;		
		return;
	}
	if(stSysCurrTime.u8Month != pstCtrl_PowerDown_Save_Info->stSysCurrTime.u8Month)
	{
		//跨月清除相关记录变量
		pstCtrl_Info->u32EnergyAlarmTimeoutTick = 0;
		pstCtrl_Info->u8EnergyAlarmFlag = 0;
		pstCtrl_Info->u8EnergyCtrlSwitchState = 0;	
		pstCtrl_PowerDown_Save_Info->stSysCurrTime.u8Month = stSysCurrTime.u8Month;
	}
	//点亮电控灯
	pstCtrl_Info->u8LedState |= LED_ENERGYCTRL;	
	if(pstCtrl_Info->u8EnergyCtrl_RoundFlag == 0)
	{
		return;
	}
	Energy_Ctrl_Month(pstCtrl_Info,pstCtrl_PowerDown_Save_Info);
}




#define ALARM_START							0x01
#define ALARM_END							0x02
/**--------------------------------------------------------------------
*功    能:南网控制告警处理
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Ctrl_Alarm_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u8 u8AlarmFlag = 0,i = 0,u8YKSwitchState_Old = 0,u8YKSwitchState_New = 0;
	u32 u32CurrTick = 0,u32YKAlarmTimeoutTick = 0,u32AlarmTimeout = 0;


	//err20181107 增加告警 功率超定值 将告警放在函数前面，防止无法产生恢复告警
	QCSG_ALARM_E2000028_INFO_S* pstE2000028_Alarm_Info = (QCSG_ALARM_E2000028_INFO_S*)QCSG_ALARM_E2000028_LIST;
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	ARD02Struct stARD02Data;	
	u8 u8PnNum = 0;
	u32 u32ReadLen = 0;
	u8 u8MeterId[6];
	RealTimeYYStruct stYYTime;
	TIME_PARAM_S stSysCurrTime;
	HAL_GetSystemTime(&stSysCurrTime);
	u32CurrTick = HAL_GetSystemTick();
	if(QCSG_CheckAlarmConfig(0xE2000028) == TRUE)
	{
		u8PnNum = pstPn_Ram_Data->u8PnNum;	
		for(i = 0;i < u8PnNum;i++)
		{
			//寻找内存中记录的测量点数据信息
			if(0 == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
			{
				pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
				break;
			}
		}	
		if(i >= u8PnNum)
		{
			return;
		}
	
		if(0x00 == pstE2000028_Alarm_Info->u8AlarmFlag)
		{//初次进入,初始化
			pstE2000028_Alarm_Info->u8AlarmFlag = 0xFF;
		}
	
		//err20181107 增加告警 功率超定值
		
		if(pstE2000028_Alarm_Info->u8AlarmFlag == 0xFF)
		{
			if((pstCtrl_Info->u8PowerAlarmFlag != 0) || ((pstCtrl_Info->u8PowerCtrlSwitchState & 0x04) != 0))//功率超定值告警产生
			{
				if(pstE2000028_Alarm_Info->u8OccurStep != ALARM_START)
				{
					pstE2000028_Alarm_Info->u8OccurStep = ALARM_START;
					pstE2000028_Alarm_Info->u32OccurTick = u32CurrTick;
				}
				if((u32CurrTick - pstE2000028_Alarm_Info->u32OccurTick) >= (1 * 30 * 100))
				{
				
					//产生发生事件
					GetACSampleAddr(u8MeterId); //取交采地址
					MemSet(&stYYTime,0,sizeof(stYYTime));
					RD_Time_TO_YYTime(&stSysCurrTime,&stYYTime);
					RD_Write_ARD02_Data(1,&stSysCurrTime,pstRam_Data,&stARD02Data);
					u32ReadLen = sizeof(stARD02Data);
					NAND_WriteAlarmRecord(u8MeterId,0xE2000028,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
					TerminalSetLastAlarmDI(0xE2000028);
					if(QCSG_CheckAlarmReport(0xE2000028) == TRUE)
					{
						TerminalReportAlarmInc();
					}								
					//pstAlarm_Info->u8OccurStep = ALARM_END;
					pstE2000028_Alarm_Info->u8AlarmFlag = 0x01;
				}
				
			}
			else 
			{
				pstE2000028_Alarm_Info->u8OccurStep = ALARM_END;
				pstE2000028_Alarm_Info->u32OccurTick = u32CurrTick;	
				//pstE2000028_Alarm_Info->u8AlarmFlag = 0xFF;	
			}
		}
		
		if(pstE2000028_Alarm_Info->u8AlarmFlag == 0x01)
		{
			if((pstCtrl_Info->u8PowerAlarmFlag == 0) && ((pstCtrl_Info->u8PowerCtrlSwitchState & 0x04) == 0))//功率超定值告警恢复
			{
				if(pstE2000028_Alarm_Info->u8RestoreStep != ALARM_START)
				{
					pstE2000028_Alarm_Info->u8RestoreStep = ALARM_START;
					pstE2000028_Alarm_Info->u32RestoreTick = u32CurrTick;
				}
				if((u32CurrTick - pstE2000028_Alarm_Info->u32RestoreTick) >= (1 * 30 * 100))
				{
					//产生恢复事件
					GetACSampleAddr(u8MeterId); //取交采地址
					MemSet(&stYYTime,0,sizeof(stYYTime));
					RD_Time_TO_YYTime(&stSysCurrTime,&stYYTime);
					RD_Write_ARD02_Data(0,&stSysCurrTime,pstRam_Data,&stARD02Data);
					u32ReadLen = sizeof(stARD02Data);
					NAND_WriteAlarmRecord(u8MeterId,0xE2000028,&stYYTime,(u8*)&stARD02Data,&u32ReadLen);
					TerminalSetLastAlarmDI(0xE2000028);
					if(QCSG_CheckAlarmReport(0xE2000028) == TRUE)
					{
						TerminalReportAlarmInc();
					}								
					//pstAlarm_Info->u8RestoreStep = ALARM_END;
					//pstAlarm_Info->u32RestoreTick = u32CurrTick;
					pstE2000028_Alarm_Info->u8AlarmFlag = 0xFF; 		
				}		
			}
			else
			{
				pstE2000028_Alarm_Info->u8RestoreStep = ALARM_END;
				pstE2000028_Alarm_Info->u32RestoreTick = u32CurrTick;				
			}
		}
	}


	
	u8AlarmFlag = pstCtrl_Info->u8PowerAlarmFlag | pstCtrl_Info->u8EnergyAlarmFlag | pstCtrl_Info->u8YKAlarmFlag;
	if(u8AlarmFlag == 0)
	{
		//功控、电控都没有告警
		Pin_OutH(PIN_ALARM_OUT);
		//关闭告警灯
		pstCtrl_Info->u8LedState &= (~LED_ALARM);				
		return;
	}
	u32CurrTick = HAL_GetSystemTick();
	// 1s进入一次
	if((u32CurrTick - pstCtrl_Info->u32AlarmTick) < 100)
	{
		return;
	}
	pstCtrl_Info->u32AlarmTick = u32CurrTick;
	if(pstCtrl_Info->u32PowerAlarmTimeoutTick != 0)
	{
		if((u32CurrTick - pstCtrl_Info->u32PowerAlarmTimeoutTick) >= pstCtrl_Info->u32AlarmTimeout)
		{
			//清告警状态标志，开始控制输出
			pstCtrl_Info->u8PowerAlarmFlag = 0;
			pstCtrl_Info->u32PowerAlarmTimeoutTick = 0;
			for(i = 0;i < 4;i++)
			{
				if(((pstCtrl_Info->u8PowerCtrl_RoundFlag >> i) & 0x01) != 0)
				{
					if(((pstCtrl_Info->u8PowerCtrlSwitchState >> i) & 0x01) != 0)//若原先已经是跳闸状态
					{
						continue;
					}
					else
					{
						pstCtrl_Info->u8PowerCtrlSwitchState |= (1 << i);//跳闸
						break;
					}
				}
			}
		}
	}
	if(pstCtrl_Info->u32EnergyAlarmTimeoutTick != 0)
	{
		if((u32CurrTick - pstCtrl_Info->u32EnergyAlarmTimeoutTick) >= pstCtrl_Info->u32AlarmTimeout)
		{
			//清告警状态标志，开始控制输出
			pstCtrl_Info->u8EnergyAlarmFlag = 0;
			pstCtrl_Info->u32EnergyAlarmTimeoutTick = 0;
			for(i = 0;i < 4;i++)
			{
				if(((pstCtrl_Info->u8EnergyCtrl_RoundFlag >> i) & 0x01) != 0)
				{
					if(((pstCtrl_Info->u8EnergyCtrlSwitchState >> i) & 0x01) != 0)
					{
						continue;
					}
					else
					{
						pstCtrl_Info->u8EnergyCtrlSwitchState |= (1 << i);
						break;
					}
				}
			}		
		}
	}
	if(pstCtrl_Info->u32YKAlarmTimeoutTick != 0)
	{
		u32YKAlarmTimeoutTick = pstCtrl_Info->u32YKAlarmTimeoutTick;
		u32AlarmTimeout = pstCtrl_Info->u32AlarmTimeout;
		for(i = 0;i < 4;i++)
		{
			if((pstCtrl_Info->u8YKCtrlSwitchState & (1 << i)) != 0)
			{
				u8YKSwitchState_Old++;
			}
			if((pstCtrl_Info->u8YKCtrl_RoundFlag & (1 << i)) != 0)
			{
				u8YKSwitchState_New++;
			}
			if(u8YKSwitchState_New < u8YKSwitchState_Old)
			{
				//如果新的输出开关状态配置数量小于已跳的开关数量，说明已经有合闸操作，不进行告警处理，直接动作继电器
				u32YKAlarmTimeoutTick = 0;
				u32AlarmTimeout = 0;
			}
		}
		if((u32CurrTick - u32YKAlarmTimeoutTick) >= u32AlarmTimeout)
		{
			//清告警状态标志，开始控制输出
			pstCtrl_Info->u8YKAlarmFlag = 0;
			pstCtrl_Info->u32YKAlarmTimeoutTick = 0;
			for(i = 0;i < 4;i++)
			{
				if(((pstCtrl_Info->u8YKCtrl_RoundFlag >> i) & 0x01) != 0)	//要求跳闸
				{
					if(((pstCtrl_Info->u8YKCtrlSwitchState >> i) & 0x01) != 0)	//原先已跳，则不跳
					{
						continue;
					}
					else	//原先未跳，则跳
					{
						pstCtrl_Info->u8YKCtrlSwitchState |= (1 << i);
						break;
					}
				}
				else		//要求合闸
				{
					pstCtrl_Info->u8YKCtrlSwitchState &= (~(1 << i));		//强制合闸
				}
			}		
		}
	}
	u8AlarmFlag = pstCtrl_Info->u8PowerAlarmFlag | pstCtrl_Info->u8EnergyAlarmFlag | pstCtrl_Info->u8YKAlarmFlag;
	if(u8AlarmFlag != 0)
	{
		//点亮告警灯
		pstCtrl_Info->u8LedState |= LED_ALARM;
		HAL_BuzzerON(2,20);		
		if((u32CurrTick / 100) % 2 == 0)
		{
			//偶数，动作告警继电器
			Pin_OutL(PIN_ALARM_OUT);
		}
		else
		{
			//奇数，还原继电器状态
			Pin_OutH(PIN_ALARM_OUT);
		}	
	}
	else
	{
		Pin_OutH(PIN_ALARM_OUT);
		pstCtrl_Info->u8LedState &= (~LED_ALARM);			
	}

	

	
