gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
}
/**--------------------------------------------------------------------
*功    能:南网控制输出处理
*输入参数:pstCtrl_Info
*输出参数:pstCtrl_Info
*返    回:无
--------------------------------------------------------------------**/
void Ctrl_Out_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u8 u8SwitchState = 0;
	u32 u32CurrTick = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	// 1s进入一次
	if((u32CurrTick - pstCtrl_Info->u32CtrlOutTick) < 100)
	{
		return;
	}
	pstCtrl_Info->u32CtrlOutTick = u32CurrTick;
	u8SwitchState = pstCtrl_Info->u8PowerCtrlSwitchState | pstCtrl_Info->u8EnergyCtrlSwitchState | pstCtrl_Info->u8YKCtrlSwitchState;
	//输出继电器状态发生变化，马上进行跳闸处理
	if(u8SwitchState != pstCtrl_Info->u8YKState)
	{
		if((u8SwitchState & 0x01) != 0)	//轮次1
		{
			Pin_OutL(PIN_SWITCH_OUT1);			
		}	
		if((u8SwitchState & 0x02) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT2);			
		}
		if((u8SwitchState & 0x04) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT3);			
		}
		if((u8SwitchState & 0x08) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT4);			
		}			
	}
	pstCtrl_Info->u8YKState = u8SwitchState;
	if(u8SwitchState != 0)
	{
		pstCtrl_Info->u8YKStateBack = u8SwitchState;
	}
	QCSG_WriteTerminal_State(pstCtrl_Info->u8YXState,pstCtrl_Info->u8YKState);
	if(u8SwitchState == 0)
	{
		Pin_OutH(PIN_SWITCH_OUT1);
		Pin_OutH(PIN_SWITCH_OUT2);
		Pin_OutH(PIN_SWITCH_OUT3);
		Pin_OutH(PIN_SWITCH_OUT4);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH1);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH2);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH3);
		pstCtrl_Info->u8LedState &= (~LED_SWITCH4);
		return;
	}
	//控制LED处理
	if((u8SwitchState & 0x01) != 0)	//轮次1
	{
		pstCtrl_Info->u8LedState |= LED_SWITCH1;		
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_SWITCH1);			
	}
	if((u8SwitchState & 0x02) != 0)
	{
		pstCtrl_Info->u8LedState |= LED_SWITCH2;		
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_SWITCH2);			
	}
	if((u8SwitchState & 0x04) != 0)
	{
		pstCtrl_Info->u8LedState |= LED_SWITCH3;		
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_SWITCH3);			
	}
	if((u8SwitchState & 0x08) != 0)
	{
		pstCtrl_Info->u8LedState |= LED_SWITCH4;		
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_SWITCH4);			
	}
	//继电器输出处理
	pstCtrl_Info->u8SwitchOutTick++;
	if(pstCtrl_Info->u8SwitchOutTick == 60)
	{
		if((u8SwitchState & 0x01) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT1);			
		}	
		if((u8SwitchState & 0x02) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT2);			
		}
		if((u8SwitchState & 0x04) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT3);			
		}
		if((u8SwitchState & 0x08) != 0)
		{
			Pin_OutL(PIN_SWITCH_OUT4);			
		}				
	}
	if(pstCtrl_Info->u8SwitchOutTick > 60)
	{
		pstCtrl_Info->u8SwitchOutTick = 0;
		Pin_OutH(PIN_SWITCH_OUT1);
		Pin_OutH(PIN_SWITCH_OUT2);
		Pin_OutH(PIN_SWITCH_OUT3);
		Pin_OutH(PIN_SWITCH_OUT4);
	}
}
/**--------------------------------------------------------------------
*功    能:左模块LED灯控制
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void Ctrl_Led_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	u8 u8FrameBuf[20];
	u8 u8DataLen = 0;
	u32 u32CurrTick = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	if((pstCtrl_Info->u8PowerCtrlFlag == 0x01) || (pstCtrl_Info->u8TempRationFlag == 0x01))
	{
		pstCtrl_Info->u8LedState |= LED_POWERCTRL;		
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_POWERCTRL);		
	}
	if(pstCtrl_Info->u8EnergyCtrlFlag == 0x01)
	{
		pstCtrl_Info->u8LedState |= LED_ENERGYCTRL;			
	}
	else
	{
		pstCtrl_Info->u8LedState &= (~LED_ENERGYCTRL);				
	}
	if(pstCtrl_Info->u8LedState == pstCtrl_Info->u8LedStateBack)
	{
		if((u32CurrTick - pstCtrl_Info->u32CtrlLedTick) < 1000)
		{			
			return;
		}
	}
	pstCtrl_Info->u32CtrlLedTick = u32CurrTick;
	pstCtrl_Info->u8LedStateBack = pstCtrl_Info->u8LedState;
	u8FrameBuf[u8DataLen++] = 0x68;
	MemSet(&u8FrameBuf[u8DataLen],0xAA,6);
	u8DataLen += 6;
	u8FrameBuf[u8DataLen++] = 0x68;
	u8FrameBuf[u8DataLen++] = 0x14;
	u8FrameBuf[u8DataLen++] = 0x05;
	u8FrameBuf[u8DataLen++] = 0x01 + 0x33;
	u8FrameBuf[u8DataLen++] = 0xBB + 0x33;	
	u8FrameBuf[u8DataLen++] = 0xBB + 0x33;	
	u8FrameBuf[u8DataLen++] = 0xBB + 0x33;
	u8FrameBuf[u8DataLen++] = pstCtrl_Info->u8LedState + 0x33;	
	u8FrameBuf[u8DataLen] = (u8)SumCaculation(u8FrameBuf,u8DataLen);
	u8DataLen++;
	u8FrameBuf[u8DataLen++] = 0x16;
	//发送类型：645帧，不需要等待应答
	UartPortTxReq(TASK_ID_TerminalCtrl,PLC_PORT,u8FrameBuf,u8DataLen,0x0300,0,0);
}
/**--------------------------------------------------------------------
*功    能:控制遥信告警处理
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void Ctrl_YX_Process(QCSG_CTRL_INFO_S* pstCtrl_Info)
{
	QCSG_PN_RAM_DATA_LIST_S* pstPn_Ram_Data = (QCSG_PN_RAM_DATA_LIST_S*)QCSG_PN_RAM_DATA_LIST;
	QCSG_RAM_DATA_S* pstRam_Data = NULL;
	QCSG_ALARM_E2000001_INFO_S* pstE2000001_Alarm_Info = (QCSG_ALARM_E2000001_INFO_S*)QCSG_ALARM_E2000001_LIST;	
	QCSG_ALARM_E2000039_INFO_S* pstE2000039_Alarm_Info = (QCSG_ALARM_E2000039_INFO_S*)QCSG_ALARM_E2000039_LIST;	
	ARD02Struct stARD02Data;
	ARD09Struct stARD09Data;
	TIME_PARAM_S stTime;	
	RealTimeYYStruct stYYTime;
	u8 u8RevFrameBuf[32],u8MeterId[6],u8ALARM_E2000001_Flag = false,u8ALARM_E2000039_Flag = false;
	u8 u8PnNum = 0,u8FrameType = 0,u8DataType = 0,u8LastState = 0,u8CurrState = 0,i = 0;
	u32 u32RevLen = 0,u32Ident = 0,u32CurrTick = 0;
	LoadManagementParaStruct LoadPara;//err20180911 遥信变位告警中判断开关类型

	
	ERD03Struct stERD03Data;//err20181107 增加事件 计量门箱开闭记录
	
	u32CurrTick = HAL_GetSystemTick();
	HAL_GetSystemTime(&stTime);
	MemSet(&stYYTime,0,sizeof(stYYTime));
	RealTimeToYYTime(&stTime,&stYYTime);

	MemSet((u8*)&LoadPara, 0, sizeof(LoadManagementParaStruct));
	MR((u32)&LoadPara, ADDR_LoadManagementPara, sizeof(LoadManagementParaStruct));
/*
	if(pstE2000001_Alarm_Info->u8GetSwitchValueFlag != 0x01)
	{
		//开关为状态为开
		pstE2000001_Alarm_Info->u8SwitchValue = 0x01; 
	}
	if(pstE2000039_Alarm_Info->u8GetSwitchValueFlag != 0x01)
	{
		//开关为状态为开
		pstE2000039_Alarm_Info->u8Switch1Value = 0x01; 
		pstE2000039_Alarm_Info->u8Switch2Value = 0x01; 
		pstE2000039_Alarm_Info->u8Switch3Value = 0x01; 
		pstE2000039_Alarm_Info->u8Switch4Value = 0x01; 
	}
*/
	if(pstE2000001_Alarm_Info->u8GetSwitchValueFlag == 0x01)	//E2000001 计量装置门开闭 ARD2，参见表D.2
	{
		if(u32CurrTick >= pstCtrl_Info->u32Switch0Timeout)
		{
			if(pstCtrl_Info->u8Switch0Attr == 0x00)	//常开
			{
				//常开属性
				if(pstE2000001_Alarm_Info->u8SwitchValue == 0x00)	//闭
				{
					//开关状态为闭合
					if(pstE2000001_Alarm_Info->u8AlarmFlag != 0x01)
					{
						//产生发生告警
						u8ALARM_E2000001_Flag = true;
						stARD02Data.State = 1;
						pstE2000001_Alarm_Info->u8AlarmFlag = 0x01;
					}
				}
				else//开
				{
					//开关状态为开
					if(pstE2000001_Alarm_Info->u8AlarmFlag == 0x01)
					{
						//产生恢复告警
						u8ALARM_E2000001_Flag = true;
						stARD02Data.State = 0;
						pstE2000001_Alarm_Info->u8AlarmFlag = 0x00;
					}
				}
			}
			if(pstCtrl_Info->u8Switch0Attr == 0x01)	//常闭
			{
				//常闭属性
				if(pstE2000001_Alarm_Info->u8SwitchValue == 0x01)	//开
				{
					//开关状态为开
					if(pstE2000001_Alarm_Info->u8AlarmFlag != 0x01)
					{
						//产生发生告警
						u8ALARM_E2000001_Flag = true;
						stARD02Data.State = 1;
						pstE2000001_Alarm_Info->u8AlarmFlag = 0x01;
					}
				}
				else		//闭
				{
					//开关状态为闭合
					if(pstE2000001_Alarm_Info->u8AlarmFlag == 0x01)
					{
						//产生恢复告警
						u8ALARM_E2000001_Flag = true;
						stARD02Data.State = 0;
						pstE2000001_Alarm_Info->u8AlarmFlag = 0x00;
					}
				}		
			}
		}
	}	
	if(pstE2000039_Alarm_Info->u8GetSwitchValueFlag == 0x01)
	{
		if(pstCtrl_Info->u8Switch1Attr == 0x00)	//常开
		{
			//常开属性	
			if(pstE2000039_Alarm_Info->u8Switch1Value == 0x00)	//闭
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm1Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm1Flag = 0x01;
				}			
			}
			else		//开
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm1Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm1Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch1Attr == 0x01)	//常闭
		{
			//常闭属性
			if(pstE2000039_Alarm_Info->u8Switch1Value == 0x01)	//开
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm1Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm1Flag = 0x01;
				}
			}
			else	//闭
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm1Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm1Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch2Attr == 0x00)
		{
			//常开属性	
			if(pstE2000039_Alarm_Info->u8Switch2Value == 0x00)	
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm2Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm2Flag = 0x01;
				}			
			}
			else
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm2Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm2Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch2Attr == 0x01)
		{
			//常闭属性
			if(pstE2000039_Alarm_Info->u8Switch2Value == 0x01)
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm2Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm2Flag = 0x01;
				}
			}
			else
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm2Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm2Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch3Attr == 0x00)
		{
			//常开属性	
			if(pstE2000039_Alarm_Info->u8Switch3Value == 0x00)	
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm3Flag != 0x01)//err20180506 2 -> 3  
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm3Flag = 0x01;//err20180506 2 -> 3  
				}			
			}
			else
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm3Flag == 0x01)//err20180506 2 -> 3  
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm3Flag = 0x00;//err20180506 2 -> 3  
				}
			}		
		}
		if(pstCtrl_Info->u8Switch3Attr == 0x01)
		{
			//常闭属性
			if(pstE2000039_Alarm_Info->u8Switch3Value == 0x01)
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm3Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm3Flag = 0x01;
				}
			}
			else
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm3Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm3Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch4Attr == 0x00)
		{
			//常开属性	
			if(pstE2000039_Alarm_Info->u8Switch4Value == 0x00)	
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm4Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm4Flag = 0x01;
				}			
			}
			else
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm4Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm4Flag = 0x00;
				}
			}		
		}
		if(pstCtrl_Info->u8Switch4Attr == 0x01)
		{
			//常闭属性
			if(pstE2000039_Alarm_Info->u8Switch4Value == 0x01)
			{
				//开关状态为开
				if(pstE2000039_Alarm_Info->u8Alarm4Flag != 0x01)
				{
					//产生发生告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm4Flag = 0x01;
				}
			}
			else
			{
				//开关状态为闭合
				if(pstE2000039_Alarm_Info->u8Alarm4Flag == 0x01)
				{
					//产生恢复告警
					u8ALARM_E2000039_Flag = true;
					stARD09Data.State = 1;
					pstE2000039_Alarm_Info->u8Alarm4Flag = 0x00;
				}
			}		
		}
	}	
	if(u8ALARM_E2000001_Flag == true)	//有E2000001告警产生
	{
		if((QCSG_CheckAlarmConfig(0xE2000001) != TRUE))
		{
			return;
		}
		u8PnNum = pstPn_Ram_Data->u8PnNum;
		for(i = 0;i < u8PnNum;i++)
		{
			//寻找内存中记录的测量点数据信息
			if(0 == pstPn_Ram_Data->stPn_Ram_Data[i].u16Pn)
			{
				pstRam_Data = &pstPn_Ram_Data->stPn_Ram_Data[i];
				break;
			}
		}	
		if(i >= u8PnNum)
		{
			MemSet(&stARD02Data.C_00010000[0],0xFF,4);
			MemSet(&stARD02Data.C_00020000[0],0xFF,4);
			MemSet(&stARD02Data.C_00030000[0],0xFF,4);
			MemSet(&stARD02Data.C_00040000[0],0xFF,4);	
			MemSet(&stARD02Data.C_0201FF00[0],0xFF,6);		
			MemSet(&stARD02Data.C_0202FF00[0],0xFF,9);	
			MemSet(&stARD02Data.C_0203FF00[0],0xFF,12);
			MemSet(&stARD02Data.C_0204FF00[0],0xFF,12);
			MemSet(&stARD02Data.C_0206FF00[0],0xFF,8);		
		}
		else
		{
			MemCopy(&stARD02Data.C_00010000[0],pstRam_Data->u8Data00010000,4);
			MemCopy(&stARD02Data.C_00020000[0],pstRam_Data->u8Data00020000,4);
			MemCopy(&stARD02Data.C_00030000[0],pstRam_Data->u8Data00030000,4);
			MemCopy(&stARD02Data.C_00040000[0],pstRam_Data->u8Data00040000,4);	
			MemCopy(&stARD02Data.C_0201FF00[0],&pstRam_Data->u8Data0201FF00,6);		
			MemCopy(&stARD02Data.C_0202FF00[0],&pstRam_Data->u8Data0202FF00,9);	
			MemCopy(&stARD02Data.C_0203FF00[0],&pstRam_Data->u8Data0203FF00,12);
			MemCopy(&stARD02Data.C_0204FF00[0],&pstRam_Data->u8Data0204FF00,12);
			MemCopy(&stARD02Data.C_0206FF00[0],&pstRam_Data->u8Data0206FF00,8);				
		}				
		GetACSampleAddr(u8MeterId);		
		stARD02Data.ReportState = 0;
		MemCopy(&stARD02Data.Time,&stTime,sizeof(TIME_PARAM_S));
		u32RevLen = sizeof(stARD02Data);
		NAND_WriteAlarmRecord(u8MeterId,0xE2000001,&stYYTime,(u8*)&stARD02Data,&u32RevLen);
		TerminalSetLastAlarmDI(0xE2000001);
		if(QCSG_CheckAlarmReport(0xE2000001) == TRUE)
		{
			TerminalReportAlarmInc();
		}						

