gdgly/NUC97X_JS/STM32F4xx/CSG/QCSG_Control/QCSG_Ctrl.c
		////err20181107 增加事件 计量门箱开闭记录
		if(QCSG_CheckEventMask(0xE2010015) == TRUE)
		{
			//发送时间和恢复时间 均为当前时间
			MemCopy(&stERD03Data.StartTime,&stTime,sizeof(TIME_PARAM_S));
			MemCopy(&stERD03Data.EndTime,&stTime,sizeof(TIME_PARAM_S));
			//直接将事件增量为 0
			MemSet(stERD03Data.C_00010000,0x00,4);
			MemSet(stERD03Data.C_00020000,0x00,4);
			MemSet(stERD03Data.C_00030000,0x00,4);
			MemSet(stERD03Data.C_00040000,0x00,4);
			
			//记录事件
			//MemSet(&stYYTime,0,sizeof(stYYTime));
			//RD_Time_TO_YYTime(pstTime,&stYYTime);
			//RD_Write_ERD3_Data(&pstEvent_Info_ERD3,&stERD03Data);
			u32RevLen = sizeof(stERD03Data);
			NAND_WriteEventRecord(u8MeterId,0xE2010015,&stYYTime,(u8*)&stERD03Data,&u32RevLen);
		}


		
		u8ALARM_E2000001_Flag = false;
	}
	if(u8ALARM_E2000039_Flag == true)	//有E2000039告警产生
	{
		if((QCSG_CheckAlarmConfig(0xE2000039) != TRUE))
		{
			return;
		}
		stARD09Data.ReportState = 0;
		MemCopy(&stARD09Data.Time,&stTime,sizeof(TIME_PARAM_S));
		MemSet(stARD09Data.B_E0000C1F,0x00,16);
		MemSet(stARD09Data.A_E0000C1F,0x00,16);

//err20180911 遥信变位告警中判断开关类型
//根据开关类型设置节点状态
		if(LoadPara.SwitchNodeType[0] == 0x00) //00常开触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x10) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[0] = 0x01;	//01分状态
			}
			else 
				stARD09Data.B_E0000C1F[0] = 0x00;	//00合状态

			if((pstCtrl_Info->u8YXState & 0x10) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[0] = 0x01;	//01分状态
			}
			else 
				stARD09Data.A_E0000C1F[0] = 0x00;	//00合状态
		}
		else												//01常闭触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x10) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[0] = 0x00;	//00合状态
			}
			else 
				stARD09Data.B_E0000C1F[0] = 0x01;	//01分状态

			if((pstCtrl_Info->u8YXState & 0x10) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[0] = 0x00;	//00合状态
			}
			else 
				stARD09Data.A_E0000C1F[0] = 0x01;	//01分状态
		}

		if(LoadPara.SwitchNodeType[1] == 0x00) //00常开触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x01) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[1] = 0x01;	//01分状态
			}
			else 
				stARD09Data.B_E0000C1F[1] = 0x00;	//00合状态

			if((pstCtrl_Info->u8YXState & 0x01) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[1] = 0x01;	//01分状态
			}
			else 
				stARD09Data.A_E0000C1F[1] = 0x00;	//00合状态
		}
		else												//01常闭触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x01) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[1] = 0x00;	//00合状态
			}
			else 
				stARD09Data.B_E0000C1F[1] = 0x01;	//01分状态

			if((pstCtrl_Info->u8YXState & 0x01) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[1] = 0x00;	//00合状态
			}
			else 
				stARD09Data.A_E0000C1F[1] = 0x01;	//01分状态
		}

		if(LoadPara.SwitchNodeType[2] == 0x00) //00常开触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x02) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[2] = 0x01;	//01分状态
			}
			else 
				stARD09Data.B_E0000C1F[2] = 0x00;	//00合状态

			if((pstCtrl_Info->u8YXState & 0x02) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[2] = 0x01;	//01分状态
			}
			else 
				stARD09Data.A_E0000C1F[2] = 0x00;	//00合状态
		}
		else												//01常闭触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x02) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[2] = 0x00;	//00合状态
			}
			else 
				stARD09Data.B_E0000C1F[2] = 0x01;	//01分状态

			if((pstCtrl_Info->u8YXState & 0x02) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[2] = 0x00;	//00合状态
			}
			else 
				stARD09Data.A_E0000C1F[2] = 0x01;	//01分状态
		}

		if(LoadPara.SwitchNodeType[3] == 0x00) //00常开触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x04) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[3] = 0x01;	//01分状态
			}
			else 
				stARD09Data.B_E0000C1F[3] = 0x00;	//00合状态

			if((pstCtrl_Info->u8YXState & 0x04) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[3] = 0x01;	//01分状态
			}
			else 
				stARD09Data.A_E0000C1F[3] = 0x00;	//00合状态
		}
		else												//01常闭触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x04) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[3] = 0x00;	//00合状态
			}
			else 
				stARD09Data.B_E0000C1F[3] = 0x01;	//01分状态

			if((pstCtrl_Info->u8YXState & 0x04) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[3] = 0x00;	//00合状态
			}
			else 
				stARD09Data.A_E0000C1F[3] = 0x01;	//01分状态
		}

		if(LoadPara.SwitchNodeType[4] == 0x00) //00常开触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x08) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[4] = 0x01;	//01分状态
			}
			else 
				stARD09Data.B_E0000C1F[4] = 0x00;	//00合状态

			if((pstCtrl_Info->u8YXState & 0x08) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[4] = 0x01;	//01分状态
			}
			else 
				stARD09Data.A_E0000C1F[4] = 0x00;	//00合状态
		}
		else												//01常闭触点
		{
			if((pstCtrl_Info->u8YXLastState & 0x08) == 0)		//0短接
			{
				stARD09Data.B_E0000C1F[4] = 0x00;	//00合状态
			}
			else 
				stARD09Data.B_E0000C1F[4] = 0x01;	//01分状态

			if((pstCtrl_Info->u8YXState & 0x08) == 0)		//0短接
			{
				stARD09Data.A_E0000C1F[4] = 0x00;	//00合状态
			}
			else 
				stARD09Data.A_E0000C1F[4] = 0x01;	//01分状态
		}

/*	
//err20180911 遥信变位告警中判断开关类型 原代码
		if((pstCtrl_Info->u8YXLastState & 0x10) == 0)
		{
			stARD09Data.B_E0000C1F[0] = 0;				
		}
		if((pstCtrl_Info->u8YXLastState & 0x01) == 0)
		{
			stARD09Data.B_E0000C1F[1] = 0;
		}
		if((pstCtrl_Info->u8YXLastState & 0x02) == 0)
		{
			stARD09Data.B_E0000C1F[2] = 0;
		}	
		if((pstCtrl_Info->u8YXLastState & 0x04) == 0)
		{
			stARD09Data.B_E0000C1F[3] = 0;
		}
		if((pstCtrl_Info->u8YXLastState & 0x08) == 0)
		{
			stARD09Data.B_E0000C1F[4] = 0;
		}		
		if((pstCtrl_Info->u8YXState & 0x10) == 0)
		{
			stARD09Data.A_E0000C1F[0] = 0;				
		}
		if((pstCtrl_Info->u8YXState & 0x01) == 0)
		{
			stARD09Data.A_E0000C1F[1] = 0;
		}
		if((pstCtrl_Info->u8YXState & 0x02) == 0)
		{
			stARD09Data.A_E0000C1F[2] = 0;
		}	
		if((pstCtrl_Info->u8YXState & 0x04) == 0)
		{
			stARD09Data.A_E0000C1F[3] = 0;
		}
		if((pstCtrl_Info->u8YXState & 0x08) == 0)
		{
			stARD09Data.A_E0000C1F[4] = 0;
		}		
*/
		GetACSampleAddr(u8MeterId);	
		u32RevLen = sizeof(stARD09Data);		
		NAND_WriteAlarmRecord(u8MeterId,0xE2000039,&stYYTime,(u8*)&stARD09Data,&u32RevLen);	
		TerminalSetLastAlarmDI(0xE2000039);		
		if(QCSG_CheckAlarmReport(0xE2000039) == TRUE)
		{
			TerminalReportAlarmInc();
		}				
		u8ALARM_E2000039_Flag = false;
	}	



	//读遥信模块数据
	if(UartPortRxReq(PLC_PORT,u8RevFrameBuf,&u32RevLen,&u8FrameType,&u8DataType) != NO_ERROR)
	{
		return;
	}
   	if(QCSG_Dlt645FrameJudge(u8RevFrameBuf,(u8*)&u32RevLen) != TRUE)
	{
		return;
	}	
	for(i = 0;i < u32RevLen;i++)
	{
		u8RevFrameBuf[10 + i] -= 0x33;			
	}		
    MemCopy(&u32Ident,&u8RevFrameBuf[10],4);	
	switch(u32Ident)
	{
		case 0x01CCCCCC:	//遥信状态
			u8CurrState = u8RevFrameBuf[15];
			pstCtrl_Info->u8YXState = u8CurrState;
			pstE2000001_Alarm_Info->u8GetSwitchValueFlag = 0x01;
			pstE2000001_Alarm_Info->u8SwitchValue = (u8CurrState >> 4) & 0x01;
			break;
		case 0x02CCCCCC:
		case 0x03CCCCCC:
		case 0x04CCCCCC:
		case 0x05CCCCCC:
			u8LastState = u8RevFrameBuf[14];
			u8CurrState = u8RevFrameBuf[15];
			pstCtrl_Info->u8YXState = u8CurrState;
			pstCtrl_Info->u8YXLastState = u8LastState;
			pstE2000039_Alarm_Info->u8GetSwitchValueFlag = 0x01;
			pstE2000039_Alarm_Info->u8Switch1Value = (u8CurrState) & 0x01;
			pstE2000039_Alarm_Info->u8Switch2Value = (u8CurrState>>1) & 0x01;
			pstE2000039_Alarm_Info->u8Switch3Value = (u8CurrState>>2) & 0x01;
			pstE2000039_Alarm_Info->u8Switch4Value = (u8CurrState>>3) & 0x01;
			break;
		case 0xFFCCCCCC:
			u8CurrState = u8RevFrameBuf[14];	
			pstCtrl_Info->u8YXState = u8CurrState;
#if (TEST_ON == 1)
			if(pstE2000039_Alarm_Info->u8GetSwitchValueFlag == 0)//第一次接收节点状态
				pstCtrl_Info->u8YXLastState = u8CurrState;
#endif
			pstE2000039_Alarm_Info->u8GetSwitchValueFlag = 0x01;
			pstE2000001_Alarm_Info->u8GetSwitchValueFlag = 0x01;
			pstE2000039_Alarm_Info->u8Switch1Value = (u8CurrState) & 0x01;
			pstE2000039_Alarm_Info->u8Switch2Value = (u8CurrState>>1) & 0x01;
			pstE2000039_Alarm_Info->u8Switch3Value = (u8CurrState>>2) & 0x01;
			pstE2000039_Alarm_Info->u8Switch4Value = (u8CurrState>>3) & 0x01;	
			pstE2000001_Alarm_Info->u8SwitchValue = (u8CurrState >> 4) & 0x01;			
			break;
	}			
	QCSG_WriteTerminal_State(pstCtrl_Info->u8YXState,pstCtrl_Info->u8YKState);
}
/**--------------------------------------------------------------------
*功    能:南网控制任务，控制任务
*输入参数:无
*输出参数:无
*返    回:无
--------------------------------------------------------------------**/
void QCSG_Ctrl_Task(void)
{
	LoadManagementParaStruct* pstCtrl_Param_Info = (LoadManagementParaStruct*)QCSG_CTRL_PARAM_INFO;
	QCSG_CTRL_INFO_S* pstCtrl_Info = (QCSG_CTRL_INFO_S*)QCSG_CTRL_INFO;
	QCSG_CTRL_POWERDOWN_SAVE_INFO_S* pstCtrl_PowerDown_Save_Info = (QCSG_CTRL_POWERDOWN_SAVE_INFO_S*)QCSG_CTRL_POWERDOWN_SAVE_INFO;
	u32 u32CurrTick = 0;
	
	u32CurrTick = HAL_GetSystemTick();
	if((u32CurrTick - pstCtrl_Info->u32ReadCtrlParamTick) > 6000)
	{
		//刷新控制参数
		Update_Ctrl_Info(pstCtrl_Param_Info,pstCtrl_Info,pstCtrl_PowerDown_Save_Info);
		pstCtrl_Info->u32ReadCtrlParamTick = u32CurrTick;
	}
	//实时刷新部分控制参数
	RealTime_Update_Ctrl_Info(pstCtrl_Param_Info,pstCtrl_Info);
	//遥信处理
	Ctrl_YX_Process(pstCtrl_Info);
	//左模块LED灯处理
	Ctrl_Led_Process(pstCtrl_Info);	
	if((pstCtrl_Info->u8YKState == 0) && (pstCtrl_Info->u8YKStateBack != 0))
	{
		//控制解除
		pstCtrl_Info->u8YKStateBack = 0;
		pstCtrl_Info->u32BuzzerTimeout = u32CurrTick;
		pstCtrl_Info->u32BuzzerTickBack = u32CurrTick;
	}
	if(pstCtrl_Info->u8YKState != 0)
	{
		//还在控制状态
		pstCtrl_Info->u32BuzzerTimeout = 0;
	}
	if((pstCtrl_Info->u32BuzzerTimeout != 0) && (u32CurrTick != pstCtrl_Info->u32BuzzerTickBack))
	{
		pstCtrl_Info->u32BuzzerTickBack = u32CurrTick;
		if((u32CurrTick % 100) == 0)
		{
			HAL_BuzzerON(2,20);  
		}
		if((u32CurrTick - pstCtrl_Info->u32BuzzerTimeout) >= 100 * 60 * 3)
		{
			pstCtrl_Info->u32BuzzerTimeout = 0;
		}
	}
	//获取终端保电状态	
	if(GetPowerHoldState(pstCtrl_Info,pstCtrl_Param_Info) == TRUE)
	{
		return;
	}
	//遥控
	YK_Ctrl_Process(pstCtrl_Info);	
	//功控
	Power_Ctrl_Process(pstCtrl_Info);
	//电控
	Energy_Ctrl_Process(pstCtrl_Info,pstCtrl_PowerDown_Save_Info);
	//告警
	Ctrl_Alarm_Process(pstCtrl_Info);
	//控制输出
	Ctrl_Out_Process(pstCtrl_Info);
}
#endif
/************************ (C) COPYRIGHT zhaoyun***********************END OF FILE****/


